driver-tests/recovery/RecoveryTesting/JMSBased/BPJavaBPCompApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:main="http://j2ee.netbeans.org/wsdl/MainFeeder">
  <soapenv:Body>
    <main:TextPart>Sending in the message</main:TextPart>
  </soapenv:Body>
</soapenv:Envelope>